# People Report Data

In [110]:
import pandas as pd
import numpy as np
import sqlalchemy
from sqlalchemy import create_engine
#format: [DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]
engine = create_engine('mysql+mysqlconnector://cnguyen:Imq2MPSzsF5wdd8fBGA@hr-api-production-replica.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/humi')

In [111]:
engine_2 = create_engine('mysql+mysqlconnector://ili:f9FqFe93htPT13nzx@humi-data-agg.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/test')

## Women in workforce

### % increase in female hires between 2020 and 2021

In [41]:
# Total new hires
total_hires_query = "select count(`id`),`hired_at` \
from employees \
where `deleted_at` is null and legal_sex is not null and hired_at > '2019-12-31 23:59:59' \
group by YEAR(`hired_at`) \
order by `hired_at`"
pd.read_sql_query(total_hires_query, con=engine)

   count(`id`)            hired_at
0        15863 2020-04-13 00:00:00
1        17617 2021-02-01 00:00:00
2            3 2022-02-21 05:00:00

In [42]:
# Female new hires
Female_hires_query = "select count(`id`),`hired_at` \
from employees \
where `deleted_at` is null and legal_sex = 'F' and hired_at > '2019-12-31 23:59:59' \
group by YEAR(`hired_at`) \
order by `hired_at`"
pd.read_sql_query(Female_hires_query, con=engine)

   count(`id`)            hired_at
0         7139 2020-04-13 00:00:00
1         8139 2021-02-01 00:00:00
2            1 2022-06-21 04:00:00

### % of gender distribution in terminations 2019, 2020, 2021

In [47]:
employees_query = "select id, company_id, job_id, hired_at, terminated_on, deleted_at, legal_sex from employees where hired_at != '3-01-03 00:00:00' \
and hired_at != '0001-01-20 00:00:00' and hired_at != '0001-08-19 21:54:51' and hired_at != '0021-07-08 05:17:32' and hired_at != '0201-09-01 00:00:00'"
employees = pd.read_sql_query(employees_query, con=engine)

In [48]:
company_bad_re_query = "select id as company_id, deleted_at as c_deleted from companies where deleted_at is not null"
company_bad_re = pd.read_sql_query(company_bad_re_query,con=engine)

In [49]:
employees = employees.merge(company_bad_re, how="left",on="company_id")
employees = employees[employees['c_deleted'].isna()]
employees.loc[employees['terminated_on'].isna()==False,'deleted_at'] = np.nan

In [ ]:
# live employees (hired - deleted - terminated)

In [94]:
employees_2019 = employees[employees['hired_at']<'2019-12-31 23:59:59']

employees_2019.loc[((employees_2019['terminated_on'].isna())&(employees_2019['deleted_at'].isna())|
                   (employees_2019['terminated_on']>'2019-12-31 23:59:59')
                   |(employees_2019['deleted_at']>'2029-12-31 23:59:59')),"live data"] = True
employees_2019 = employees_2019[employees_2019['live data'] == True]

In [95]:
employees_2019_gender = employees_2019.dropna(subset=['legal_sex'])
employees_2019_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0                1
1         F  14465
2         M  16916
3         P   1908
4         X      8

In [96]:
employees_2020 = employees[employees['hired_at']<'2020-12-31 23:59:59']

employees_2020.loc[((employees_2020['terminated_on'].isna())&(employees_2020['deleted_at'].isna())|
                   (employees_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(employees_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
employees_2020 = employees_2020[employees_2020['live data'] == True]
employees_2020_gender = employees_2020.dropna(subset=['legal_sex'])
employees_2020_gender.groupby(["legal_sex"],as_index=False).size()

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

  legal_sex   size
0                1
1         F  18280
2         M  21399
3         P   1921
4         X     11

In [97]:
employees_2021 = employees[employees['hired_at']<'2021-12-31 23:59:59']

employees_2021.loc[((employees_2021['terminated_on'].isna())&(employees_2021['deleted_at'].isna())|
                   (employees_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(employees_2021['deleted_at']>'2021-12-31 23:59:59')
                   ),"live data"] = True
employees_2021 = employees_2021[employees_2021['live data'] == True]
employees_2021_gender = employees_2021.dropna(subset=['legal_sex'])
employees_2021_gender.groupby(["legal_sex"],as_index=False).size()

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

  legal_sex   size
0                2
1         F  21984
2         M  24845
3         P   1761
4         X     32

In [98]:
employees_terminated_byyear = employees[employees["terminated_on"]>"2018-12-31 23:59:59"]
employees_terminated_byyear = employees_terminated_byyear.astype({'terminated_on':str})
employees_terminated_byyear.terminated_on = employees_terminated_byyear.terminated_on.str[0:4]

In [99]:
employees_terminated_byyear.pivot_table(index="terminated_on", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex           F       M      P    X
terminated_on
2019           1593.0  1811.0  421.0  NaN
2020           3667.0  4192.0  486.0  NaN
2021           4151.0  5358.0  432.0  5.0

### % of gender distribution in terminations by month in 2020, 2021

In [52]:
#employee dynamics by month by gender

In [100]:
employees_hired = employees[employees['hired_at']>'2019-12-31 23:59:59']
employees_hired=employees_hired.astype({'hired_at': str})
employees_hired.hired_at = employees_hired.hired_at.str[0:7]
employees_hired.pivot_table(index="hired_at", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex            F       M     P    X
hired_at
2020-01    NaN   683.0   765.0  80.0  1.0
2020-02    NaN   500.0   525.0  52.0  NaN
2020-03    NaN   498.0   549.0  22.0  NaN
2020-04    NaN   325.0   511.0  23.0  NaN
2020-05    NaN   402.0   556.0  35.0  NaN
2020-06    NaN   559.0   667.0  38.0  NaN
2020-07    NaN   669.0   819.0  56.0  1.0
2020-08    NaN   812.0   828.0  58.0  NaN
2020-09    NaN   885.0   987.0  41.0  1.0
2020-10    NaN   794.0   844.0  42.0  NaN
2020-11    NaN   787.0   985.0  50.0  NaN
2020-12    NaN   531.0   559.0  29.0  NaN
2021-01    NaN  1000.0  1221.0  57.0  3.0
2021-02    NaN   826.0   912.0  48.0  2.0
2021-03    NaN  1142.0  1216.0  68.0  2.0
2021-04    NaN   983.0  1087.0  31.0  4.0
2021-05    1.0  1406.0  1533.0  46.0  5.0
2021-06    NaN  1202.0  1379.0  48.0  6.0
2021-07    NaN  1179.0  1301.0  30.0  5.0
2021-08    NaN   587.0   637.0  12.0  3.0
2021-09    NaN    34.0    65.0   NaN  NaN
2021-10    NaN     1.0     6.0   NaN  NaN
2021-11    NaN     2.0     1.0   NaN  NaN
2021-12    NaN     1.0     2.0   NaN  NaN
2022-01    NaN     NaN     1.0   NaN  NaN
2022-02    NaN     NaN     1.0   NaN  NaN
2022-06    NaN     1.0     NaN   NaN  NaN

In [101]:
# those deleted b/c of company churn

In [102]:
employees_deleted = employees[employees['deleted_at']>'2019-12-31 23:59:59']
employees_deleted=employees_deleted.astype({'deleted_at': str})
employees_deleted.deleted_at = employees_deleted.deleted_at.str[0:7]
employees_deleted.pivot_table(index="deleted_at", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex       F      M     P    X
deleted_at
2020-07       4.0    2.0   5.0  NaN
2020-08      23.0   48.0  28.0  NaN
2020-09      37.0   53.0  10.0  NaN
2020-10      55.0   65.0   3.0  NaN
2020-11      32.0   34.0  15.0  NaN
2020-12      58.0   65.0  14.0  NaN
2021-01      47.0   79.0   5.0  NaN
2021-02      36.0   39.0   6.0  NaN
2021-03     151.0  147.0   8.0  NaN
2021-04      65.0   60.0   7.0  1.0
2021-05      82.0  113.0  19.0  NaN
2021-06      60.0   48.0  12.0  1.0
2021-07      41.0   41.0  11.0  1.0
2021-08      24.0   27.0   NaN  1.0

In [103]:
employees_terminated_bymonth = employees[employees["terminated_on"]>"2019-12-31 23:59:59"]

In [104]:
employees_terminated_bymonth = employees_terminated_bymonth.astype({'terminated_on':str})
employees_terminated_bymonth.terminated_on = employees_terminated_bymonth.terminated_on.str[0:7]

In [105]:
employees_terminated_bymonth.pivot_table(index="terminated_on", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex          F      M      P    X
terminated_on
2020-01        274.0  267.0   76.0  NaN
2020-02        167.0  216.0   33.0  NaN
2020-03        286.0  331.0   92.0  NaN
2020-04        221.0  296.0   46.0  NaN
2020-05        177.0  199.0   26.0  NaN
2020-06        175.0  238.0   24.0  NaN
2020-07        181.0  224.0   17.0  NaN
2020-08        256.0  275.0   31.0  NaN
2020-09        442.0  467.0   36.0  NaN
2020-10        607.0  713.0   41.0  NaN
2020-11        438.0  456.0   33.0  NaN
2020-12        443.0  510.0   31.0  NaN
2021-01        369.0  546.0   37.0  NaN
2021-02        428.0  589.0   24.0  NaN
2021-03        532.0  815.0   30.0  NaN
2021-04        474.0  683.0   25.0  1.0
2021-05        603.0  684.0  225.0  NaN
2021-06        589.0  825.0   39.0  NaN
2021-07        768.0  772.0   38.0  2.0
2021-08        388.0  444.0   14.0  2.0

### % of C-Suite positions held by women

In [112]:
jobs_query = "select id, company_id, title from jobs where deleted_at is null"
jobs = pd.read_sql_query(jobs_query, con=engine)
jobs_df = jobs.copy()

In [113]:
jobs_df = jobs_df.rename(columns={"id":"job_id"})

In [114]:
combined = employees.merge(jobs_df, how="left", on = "job_id")

In [115]:
combined_df = combined.copy()

In [116]:
combined_df

,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title
0,1,2,62.0,2018-04-01 00:00:00,NaT,NaT,M,NaT,2.0,GOD
1,176,2,62.0,2018-05-14 11:24:30,2018-05-22,NaT,None,NaT,2.0,GOD
2,177,2,62.0,2018-05-14 00:00:00,NaT,2018-05-29 13:09:58,None,NaT,2.0,GOD
3,179,2,62.0,2018-05-16 00:00:00,NaT,NaT,M,NaT,2.0,GOD
4,180,4,76.0,2018-03-01 00:00:00,NaT,2018-08-28 17:57:10,None,NaT,4.0,Administrator
...,...,...,...,...,...,...,...,...,...,...
91192,95545,2156,34058.0,2022-01-05 08:00:00,NaT,NaT,None,NaT,2156.0,Lawyer
91193,95546,136,43158.0,2021-08-18 07:00:00,NaT,NaT,None,NaT,136.0,Head of People and Culture
91194,95547,170,2242.0,2021-08-15 16:00:00,NaT,NaT,None,NaT,170.0,Account Executive
91195,95548,1388,20490.0,2021-08-30 06:00:00,NaT,NaT,None,NaT,1388.0,Support Analyst
91196,95549,2473,40578.0,2021-08-16 07:00:00,NaT,NaT,None,NaT,2473.0,Landscape Labourer

In [117]:
import re

In [118]:
combined_df['title'] = combined_df['title'].str.extract(r'(chief)', re.IGNORECASE)

In [119]:
a = combined_df.dropna(subset=['title']).reset_index()

In [120]:
combined_df_2 = combined.copy()

In [121]:
combined_df_2['title'] = combined_df_2['title'].str.extract(r'(\Wc.o$)', re.IGNORECASE)

In [122]:
b = combined_df_2.dropna(subset=['title']).reset_index()

In [123]:
combined_df_3 = combined.copy()

In [124]:
combined_df_3['title'] = combined_df_3['title'].str.extract(r'(^c.o$)', re.IGNORECASE)

In [125]:
c = combined_df_3.dropna(subset=['title']).reset_index()

In [126]:
combined_df_4 = combined.copy()
combined_df_4['title'] = combined_df_4['title'].str.extract(r'(^c.o\W)', re.IGNORECASE)
d = combined_df_4.dropna(subset=['title'])

In [127]:
result = pd.concat([a,b,c,d],ignore_index=True)

In [128]:
result

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title
0,7.0,186,6,84.0,2018-05-23 00:00:00,NaT,2018-06-20 14:28:23,None,NaT,6.0,Chief
1,37.0,228,14,148.0,2016-10-01 00:00:00,NaT,2020-02-28 20:24:13,None,NaT,14.0,Chief
2,50.0,244,5,100.0,2014-04-21 00:00:00,NaT,2018-08-28 17:57:36,None,NaT,5.0,Chief
3,58.0,252,5,107.0,2014-01-01 00:00:00,NaT,2018-08-28 17:57:36,None,NaT,5.0,Chief
4,119.0,314,19,140.0,2014-07-04 00:00:00,NaT,NaT,M,NaT,19.0,Chief
...,...,...,...,...,...,...,...,...,...,...,...
2075,NaN,91513,2517,41680.0,2020-11-09 00:00:00,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO
2076,NaN,93102,2614,42165.0,2018-05-06 00:00:00,NaT,NaT,None,NaT,2614.0,CEO
2077,NaN,93299,221,17693.0,2021-08-01 07:00:00,NaT,NaT,None,NaT,221.0,CFO/
2078,NaN,95102,2683,42957.0,2020-01-06 00:00:00,NaT,NaT,P,NaT,2683.0,"CEO,"
2079,NaN,95460,2614,43122.0,2018-05-06 00:00:00,NaT,NaT,None,NaT,2614.0,"CTO,"

In [76]:
result_2020 = result[result['hired_at']<'2020-12-31 23:59:59']

result_2020.loc[((result_2020['terminated_on'].isna())&(result_2020['deleted_at'].isna())|
                   (result_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(result_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
result_2020 = result_2020[result_2020['live data'] == True]
result_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
4,119.0,314,19,140.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
5,121.0,316,19,142.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
13,527.0,726,33,30124.0,2012-05-01,NaT,NaT,F,NaT,33.0,Chief,True
15,722.0,946,37,516.0,2011-08-25,NaT,NaT,M,NaT,37.0,Chief,True
16,736.0,960,37,522.0,2011-05-01,NaT,NaT,M,NaT,37.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2074,NaN,88685,2556,40473.0,2013-02-11,NaT,NaT,M,NaT,2556.0,CEO/,True
2075,NaN,91513,2517,41680.0,2020-11-09,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO,True
2076,NaN,93102,2614,42165.0,2018-05-06,NaT,NaT,None,NaT,2614.0,CEO,True
2078,NaN,95102,2683,42957.0,2020-01-06,NaT,NaT,P,NaT,2683.0,"CEO,",True
2079,NaN,95460,2614,43122.0,2018-05-06,NaT,NaT,None,NaT,2614.0,"CTO,",True

In [129]:
result_2021 = result[result['hired_at']<'2021-12-31 23:59:59']

result_2021.loc[((result_2021['terminated_on'].isna())&(result_2021['deleted_at'].isna())|
                   (result_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(result_2021['deleted_at']>'2021-12-31 23:59:59')),"live data"] = True
result_2021 = result_2021[result_2021['live data'] == True]
result_2021

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
4,119.0,314,19,140.0,2014-07-04 00:00:00,NaT,NaT,M,NaT,19.0,Chief,True
5,121.0,316,19,142.0,2014-07-04 00:00:00,NaT,NaT,M,NaT,19.0,Chief,True
13,527.0,726,33,30124.0,2012-05-01 00:00:00,NaT,NaT,F,NaT,33.0,Chief,True
15,722.0,946,37,516.0,2011-08-25 00:00:00,NaT,NaT,M,NaT,37.0,Chief,True
16,736.0,960,37,522.0,2011-05-01 00:00:00,NaT,NaT,M,NaT,37.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2074,NaN,88685,2556,40473.0,2013-02-11 00:00:00,NaT,NaT,M,NaT,2556.0,CEO/,True
2076,NaN,93102,2614,42165.0,2018-05-06 00:00:00,NaT,NaT,None,NaT,2614.0,CEO,True
2077,NaN,93299,221,17693.0,2021-08-01 07:00:00,NaT,NaT,None,NaT,221.0,CFO/,True
2078,NaN,95102,2683,42957.0,2020-01-06 00:00:00,NaT,NaT,P,NaT,2683.0,"CEO,",True
2079,NaN,95460,2614,43122.0,2018-05-06 00:00:00,NaT,NaT,None,NaT,2614.0,"CTO,",True

In [130]:
Female_leader_2021 = result_2021[result_2021['legal_sex']=="F"]

In [131]:
Female_leader_2021

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
13,527.0,726,33,30124.0,2012-05-01 00:00:00,NaT,NaT,F,NaT,33.0,Chief,True
18,825.0,1062,56,568.0,2018-01-01 00:00:00,NaT,NaT,F,NaT,56.0,Chief,True
22,838.0,1076,52,575.0,2017-05-25 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
25,854.0,1092,52,577.0,2013-11-01 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
32,1419.0,1720,52,574.0,2018-08-13 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2042,NaN,48450,1622,25808.0,2020-05-18 00:00:00,NaT,NaT,F,NaT,1622.0,CFO/,True
2050,NaN,58315,219,12373.0,2015-09-01 00:00:00,NaT,NaT,F,NaT,219.0,CEO,True
2051,NaN,59668,1953,28994.0,2020-01-01 00:00:00,NaT,NaT,F,NaT,1953.0,"COO,",True
2057,NaN,75243,2307,35215.0,2017-07-01 07:00:00,NaT,NaT,F,NaT,2307.0,CEO,True
2059,NaN,76236,2354,35713.0,2019-04-01 00:00:00,NaT,NaT,F,NaT,2354.0,"CEO,",True

In [132]:
Female_leader_2020 = result_2020[result_2020['legal_sex']=="F"]

In [133]:
Female_leader_2020

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
13,527.0,726,33,30124.0,2012-05-01 00:00:00,NaT,NaT,F,NaT,33.0,Chief,True
18,825.0,1062,56,568.0,2018-01-01 00:00:00,NaT,NaT,F,NaT,56.0,Chief,True
22,838.0,1076,52,575.0,2017-05-25 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
25,854.0,1092,52,577.0,2013-11-01 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
32,1419.0,1720,52,574.0,2018-08-13 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2050,NaN,58315,219,12373.0,2015-09-01 00:00:00,NaT,NaT,F,NaT,219.0,CEO,True
2051,NaN,59668,1953,28994.0,2020-01-01 00:00:00,NaT,NaT,F,NaT,1953.0,"COO,",True
2057,NaN,75243,2307,35215.0,2017-07-01 07:00:00,NaT,NaT,F,NaT,2307.0,CEO,True
2059,NaN,76236,2354,35713.0,2019-04-01 00:00:00,NaT,NaT,F,NaT,2354.0,"CEO,",True
2075,NaN,91513,2517,41680.0,2020-11-09 00:00:00,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO,True

### How female leadership impacts gender distribution in companies

In [134]:
combined_2020 = combined[combined['hired_at']<'2020-12-31 23:59:59']

combined_2020.loc[((combined_2020['terminated_on'].isna())&(combined_2020['deleted_at'].isna())|
                   (combined_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(combined_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
combined_2020 = combined_2020[combined_2020['live data'] == True]

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [135]:
combined_2021 = combined[combined['hired_at']<'2021-12-31 23:59:59']

combined_2021.loc[((combined_2021['terminated_on'].isna())&(combined_2021['deleted_at'].isna())|
                   (combined_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(combined_2021['deleted_at']>'2021-12-31 23:59:59')),"live data"] = True
combined_2021 = combined_2021[combined_2021['live data'] == True]

In [136]:
combined_2020.loc[(combined_2020['company_id_x'].isin(Female_leader_2020['company_id_x'])),"all C-Suite"] = True

In [137]:
combined_2021.loc[(combined_2021['company_id_x'].isin(Female_leader_2021['company_id_x'])),"all C-Suite"] = True

In [138]:
Female_company_2020 = combined_2020.loc[combined_2020['all C-Suite'] == True]

In [139]:
Female_company_2021 = combined_2021.loc[combined_2021['all C-Suite'] == True]

In [140]:
Female_company_2021["legal_sex"].value_counts()

F    5895
M    5052
P     290
X       9
Name: legal_sex, dtype: int64

In [141]:
Female_company_2020["legal_sex"].value_counts()

F    4946
M    4223
P     494
X       2
Name: legal_sex, dtype: int64

In [142]:
Male_company_2020 = combined_2020.loc[combined_2020['all C-Suite'] != True]

In [143]:
Male_company_2021 = combined_2021.loc[combined_2021['all C-Suite'] != True]

In [146]:
Male_company_2021["legal_sex"].value_counts()

M    19793
F    16089
P     1471
X       23
         2
Name: legal_sex, dtype: int64

In [147]:
Male_company_2020["legal_sex"].value_counts()

M    17176
F    13334
P     1427
X        9
         1
Name: legal_sex, dtype: int64

### Gender distribution by province 2021

join address, company and employee datasets

In [51]:
# address_query = "select id, `province` from addresses \
# where `deleted_at` is NULL and country = 'Canada'"
# address = pd.read_sql_query(address_query, con=engine)
# address = address.rename(columns={"id":"address_id"})
# address = address.astype({"address_id": str})

In [148]:
company_query = "select id, primary_address_id,industry from companies where deleted_at is null and is_locked = '0'"
company = pd.read_sql_query(company_query, con=engine)
company = company.rename(columns={"id":"company_id","primary_address_id":"address_id"})
company = company.astype({"company_id":str,"address_id":str})
company['address_id'] = company.apply(lambda x:x['address_id'].split('.')[0], axis=1)

In [149]:
employee_query = "select id, company_id, legal_sex, account_id from employees \
where deleted_at is null and terminated_on is null and legal_sex is not null"
employee = pd.read_sql_query(employee_query, con=engine)
employee = employee.rename(columns={"id":"employee_id"})
employee = employee.astype({"company_id": str,"employee_id":str})

In [54]:
#company_address = company.merge(address, how = "left", on = "address_id")

In [55]:
#employee_address = employee.merge(company_address, how = "left", on = "company_id")

In [56]:
#employee_address.groupby(["legal_sex","province"],as_index=False)["account_id"].nunique()

### % of women in the tech workforce 2021

In [57]:
company_df = company.copy()

In [58]:
company_df['industry'] = company_df['industry'].str.extract(r'(software|information|^tech|^it|Cyber|internet|gam)',re.IGNORECASE)

In [59]:
company_df = company_df.dropna(subset=['industry']).reset_index()

In [60]:
company_df_employee = employee.merge(company_df, how = "left", on = "company_id" ).dropna(subset=['industry']).reset_index()

In [62]:
company_df_employee.groupby(["legal_sex"],as_index=False)["account_id"].nunique()

  legal_sex  account_id
0         F        7327
1         M        9082
2         P         661
3         X           9

### % of termination due to covid

In [65]:
total_termination_query = "select count(termination_comments) from terminations \
where termination_comments is not null and terminated_at between '2018-12-31 23:59:59' and '2021-12-31 23:59:59' \
group by year(terminated_at) order by terminated_at"
pd.read_sql_query(total_termination_query,con=engine)

   count(termination_comments)
0                          142
1                         9498
2                        10215

In [66]:
covid_termination_query = "select count(termination_comments),terminated_at from terminations \
where termination_comments like '%covid%' \
and terminated_at between '2018-12-31 23:59:59' and '2021-12-31 23:59:59' \
group by year(terminated_at) order by terminated_at"
pd.read_sql_query(covid_termination_query,con=engine)

   count(termination_comments) terminated_at
0                          676    2020-04-14
1                          487    2021-01-11